tap "buildpacks/tap"
tap "felixkratz/formulae"
tap "ggerganov/ggerganov"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "kudobuilder/tap"
tap "muesli/tap"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "simonw/llm"
tap "vmware-tanzu/carvel"
# Simple, modern, secure file encryption
brew "age"
# New file format for still image compression
brew "jpeg-xl"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Collection of portable C++ source libraries
brew "boost"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Library for color text mode, widget based user interfaces
brew "newt"
# Terminal multiplexer
brew "tmux"
# Text-based window manager and terminal multiplexer
brew "byobu"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Object-file caching compiler wrapper
brew "ccache"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Cross-platform make
brew "cmake"
# Unit testing framework for C
brew "cmocka"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Ncurses based advanced hex editor featuring diff mode and more
brew "dhex"
# Dictionary Server Protocol (RFC2229) client
brew "dict"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# DjVu viewer
brew "djvulibre"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Development kit for the Java programming language
brew "openjdk"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# C XSLT library for GNOME
brew "libxslt"
# Fast and simple video downloader
brew "lux"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Package for scientific computing with Python
brew "numpy"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt@5"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# STM32 discovery line Linux programmer
brew "stlink"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line streaming torrent client
brew "webtorrent-cli"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# LLM inference in C/C++
brew "ggerganov/ggerganov/llama.cpp"
# Nomad
brew "hashicorp/tap/nomad"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Interact with KUTTL via the kubectl plugin
brew "kudobuilder/tap/kuttl-cli"
# OBS-cli is a command-line remote control for OBS
brew "muesli/tap/obs-cli"
# Pre-built GNU toolchain for Arm Cortex-M and Cortex-R processors
brew "osx-cross/arm/arm-gcc-bin@10"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Imgpkg
brew "vmware-tanzu/carvel/imgpkg"
# Kapp
brew "vmware-tanzu/carvel/kapp"
# Kbld
brew "vmware-tanzu/carvel/kbld"
# Kctrl
brew "vmware-tanzu/carvel/kctrl"
# Vendir
brew "vmware-tanzu/carvel/vendir"
# Ytt
brew "vmware-tanzu/carvel/ytt"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-hack-nerd-font"
# Download accelerator and organiser
cask "free-download-manager"
# GPU-based terminal emulator
cask "kitty"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Archive manager for data compression and backups
cask "rar"
# System monitor for the menu bar
cask "stats"
vscode "continue.continue"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "svelte.svelte-vscode"
vscode "twxs.cmake"
